# Before you start :
   #### - These exercises are related to the Subsetting and Descriptive Stats lessons.
   #### - Please keep in mind that you might also need to use some of the functions you saw in the previous lessons. Remember there is a common thread!!
   #### - All datasets are provided in this Lab's folder.
   #### - Comment as much as you can your results
   #### - Please try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary

In [2]:
import pandas as pd
import numpy as np

# Problem 1

#### In this problem we will use the Temp_States.csv file

#### Read it into a data frame, call it Temp. (Import the packages you think you need)

In [3]:
ruta='/home/cristina/Ironhack/madrid-oct-2018/module-2/Lab-Subsetting and Descriptive Stats/Temp_States.csv'
temp=pd.read_csv(ruta)
display(temp)

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

Temp

#### Explore the data types of the Temp dataframe. Comment your findings

Hay 3 columnas, dos con el tipo object y una con el tipo float64. Me extra√±a que city y state no sean string

In [4]:
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

#### Select the rows where state is New York

In [5]:
NY=temp[temp['State']=='New York']
display(NY)

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average of the temperature of cities in New York?

In [6]:
print(NY.mean())

Temperature    10.740741
dtype: float64

#### We want to know cities and states with Temperature above 15 degress Celcius

In [7]:
temp[temp['Temperature']>15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degress Celcius

In [8]:
temp.loc[temp['Temperature']>15,['City']]

       City
0       NYC
3  Hartford
5    Treton
6    Newark

#### We want to know which cities have a temperature above 15 degrees Celcius and below 25 degrees Celcius

Hint: First write the condition then select the rows.

In [14]:
temp.loc[(temp['Temperature']>15) & (temp['Temperature']<25),['City']]

       City
0       NYC
3  Hartford
5    Treton
6    Newark

#### Find the mean and the standard deviation of the temperature of each state.

##### Hint: Use functions from Data Manipulation lesson

In [17]:
temp.groupby('State').agg({'mean','std'})

            Temperature
                   mean       std
State
Connecticut   15.833333  1.964186
New Jersey    21.111111  1.571348
New York      10.740741  8.133404

# Problem 2

#### Load the employee.csv file into a DataFrame. Call the dataframe employee

In [21]:
ruta2='/home/cristina/Ironhack/madrid-oct-2018/module-2/Lab-Subsetting and Descriptive Stats/Employee.csv'
employee=pd.read_csv(ruta2)
display(employee)

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the Temp dataframe.Comment your results

In [13]:
employee.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

#### Show visually the frequency distribution of the employee dataset. Comment your result

In [14]:
# your answer here

#### What's the average salary in this company?

In [15]:
employee['Salary'].mean()

48.888888888888886

#### What's the highest salary?

In [16]:
employee['Salary'].max()

70

#### What's the lowest salary?

In [17]:
employee['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [18]:
employee.loc[employee['Salary']==30,['Name']]

    Name
1  Maria
2  David

#### Could you give all the information about an employee called David?

In [19]:
employee[employee['Name']=='David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you give only David's salary?

In [22]:
employee.loc[employee['Name']=='David',['Salary']]

   Salary
2      30

#### Print all the rows where job title is associate

In [23]:
employee[employee['Title']=='associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe

##### Tip : There are 2 ways to do it. Do it both ways

In [24]:
employee[employee['Title']=='associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

In [25]:
employee[employee['Title']=='associate'].head(3)

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Find the employees who's title is associate and the salary above 55?

In [26]:
a= employee[(employee['Title']=='associate')&(employee['Salary']>55)]
display(a)

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### What's the average Salary per year?

In [27]:
employee.groupby('Years').mean()

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average Salary per title?

In [28]:
employee.groupby('Title').mean()

           Years     Salary
Title
VP          8.00  70.000000
analyst     2.25  32.500000
associate   4.00  56.666667

#### Show a visual summary of the data using boxplot.What Are the First and Third Quartiles? Comment your results.

In [29]:
# your answer here

In [30]:
# your answer here

In [31]:
# your answer here

#### Is the mean salary per gender different?
Yes, it is

In [32]:
employee.groupby('Gender').mean()

        Years  Salary
Gender
F         4.0    47.5
M         4.2    50.0

#### Find the minimum, mean and the maximum of all numeric columns for each Department.

##### Hint: Use functions from Data Manipulation lesson

In [38]:
employee.groupby('Department').agg({'min','max','mean'})

               Years         Salary
                mean max min   mean max min
Department
HR          4.666667   8   2  45.00  70  30
IT          4.500000   8   1  48.75  70  30
Sales       2.500000   3   2  55.00  55  55

In [34]:
display(employee)

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Bonus 
##### For each department, compute the difference between the maximal salary and the minimal salary.

# Problem 3

#### Open the Orders.csv dataset. Name your dataset orders

In [42]:
orders = pd.read_csv('/home/cristina/Ironhack/madrid-oct-2018/module-2/Lab-Subsetting and Descriptive Stats/Orders.csv')
orders

FileNotFoundError: File b'/home/cristina/Ironhack/madrid-oct-2018/module-2/Lab-Subsetting and Descriptive Stats/Orders.csv' does not exist

#### Explore your dataset by looking at the data types and the summary statistics. Comment your results

In [ ]:
# your answer here

In [ ]:
# your answer here

####  What is the average Purchase Price?

In [ ]:
# your answer here

#### What were the highest and lowest purchase prices?

In [ ]:
# your answer here

In [ ]:
# your answer here

#### Select all the customers we have in Spain

In [ ]:
# your answer here

#### How many customers do we have in Spain?
##### Hint : Use value_counts()

In [ ]:
# your answer here

#### Select all the customers who have bought more than 50 items ?

In [ ]:
# your answer here

#### Select orders from Spain that are above 50 items

In [ ]:
# your answer here

#### Select all free orders

In [ ]:
# your answer here

#### Select all orders that are 'lunch bag'
#### Hint: Use string functions

In [ ]:
# your answer here

#### Select all orders that are made in 2011 and are 'lunch bag'

In [ ]:
# your answer here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your answer here

#### Select all orders made in the month of August

In [ ]:
# your answer here

#### Select how many orders are made by countries in the month of August
##### Hint: Use value_counts()

In [ ]:
# your answer here

#### What's the  average amount of money spent by country

In [ ]:
# your answer here

#### What's the most expensive item?

In [ ]:
# your answer here

#### What was the average amount spent per year ?

In [ ]:
# your answer here